# 练习1：年龄判断器
"""
输入年龄，根据以下规则输出人生阶段：
    。0-3 岁：婴幼儿
    。4-12 岁：儿童
    。13-17 岁：青少年
    。18-64 岁：成年人
    。65 岁及以上：老年人
"""

age = int(input("请输入年龄："))
if 0 <= age <= 3:
    print("婴幼儿")
elif 4 <= age <= 12:
    print("儿童")
elif 13 <= age <= 17:
    print("青少年")
elif 18 <= age <= 64:
    print("成年人")
else:
    print("老年人")

# 练习2：密码验证
"""
预设一个密码字符串，让用户输入密码，判断是否匹配。
    。如果完全匹配，输出“登录成功”
    。否则输出“密码错误”
"""

pwd = "123456"
user_input = input("请输入密码：")
if user_input == pwd:
    print("登录成功")
else:
    print("密码错误")

# 练习3：闰年判断
"""
输入一个年份，判断它是否为闰年。
闰年规则：能被4整除但不能被100整除，或者能被400整除。
"""

year = int(input("请输入年份："))
if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(year, "是闰年")
else:
    print(year, "不是闰年")
